########################################################################################################################
################################################     라이브러리 호출     ###################################################
########################################################################################################################
import pandas as pd
import streamlit as st
from utils import load_data, df_insurance, fig_linechart

########################################################################################################################
################################################     자료 전처리     ######################################################
########################################################################################################################
# ---------------------------------------    Google Sheet 데이터베이스 호출    ----------------------------------------------
# 출석부 데이터베이스 호출 (교육과정수료현황) & 컬럼 삭제 (번호)
df_august = load_data(st.secrets["aug_url"]).drop(columns=['SUNAB_PK','납입회차','납입월도','영수유형','확정자','확정일','환산월초','인정실적','실적구분','이관일자','확정유형','계약상태','최초등록일'])
df_insu = df_insurance(df_august)

insu = ['생명보험','손해보험']
df_total = pd.DataFrame(columns=['보험종목','영수/환급일','매출액'])
for i in range(2):
    # 생명보험이나 손해보험만 남기기
    df_running = df_insu.drop(df_insu[df_insu.iloc[:,0] == insu[i]].index)
    # 누적매출액 구하기
    for running in range(df_insu.shape[0]):
        try:
            df_running.iloc[running+1,2] = df_running.iloc[running+1,2] + df_running.iloc[running,2]
        except:
            pass
    st.dataframe(df_running)
    df_total = pd.concat([df_running, df_total], axis=0)

st.dataframe(df_total)
'''
df_fire = df_insu.drop(df_insu[df_insu.iloc[:,0] == '생명보험'].index)
df_fire = df_running(df_fire)
df_life = df_insu.drop(df_insu[df_insu.iloc[:,0] == '손해보험'].index)
df_life = df_running(df_life)
'''

list_line_insuarance = [df_insu, '보험종목', '매출액', '영수/환급일', '보험종목별 매출액 추이']
fig_line_insurnace = fig_linechart(list_line_insuarance)

########################################################################################################################
################################################     메인페이지 설정     ###################################################
########################################################################################################################
# authenticator.logout('Logout', 'sidebar')
# 메인페이지 타이틀
st.header("8월 매출현황")

# -----------------------------------------------------  차트 노출  ---------------------------------------------------------
st.markdown("<hr>", unsafe_allow_html=True)
st.dataframe(df_insu)
st.plotly_chart(fig_line_insurnace, use_container_width=True)

########################################################################################################################
###########################################     stremalit 워터마크 숨기기     ##############################################
########################################################################################################################
hide_st_style = """
                <style>
                #MainMenu {visibility: hidden;}
                footer {visibility: hidden;}
                header {visibility: hidden;}
                </style>
                """
st.markdown(hide_st_style, unsafe_allow_html=True)